In [193]:
import pandas as pd
import numpy as np

In [7]:
s = pd.Series([0,1,3])

In [8]:
s

0    0
1    1
2    3
dtype: int64

In [14]:
s.append(322, dtype="int64")

TypeError: append() got an unexpected keyword argument 'dtype'

In [15]:
s

0    0
1    1
2    3
dtype: int64

In [16]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
s.append(pd.Series([4,5,6]))

0    0
1    1
2    3
0    4
1    5
2    6
dtype: int64

In [18]:
s[0]

0

In [20]:
s[2]

3

In [25]:
arr = [0,1,2]
s.index = arr

In [26]:
s

0    0
1    1
2    3
dtype: int64

In [29]:
pd.date_range("20190510", periods=1)

DatetimeIndex(['2019-05-10'], dtype='datetime64[ns]', freq='D')

In [41]:
obj = pd.DataFrame({
    "users": ["Mano", "Rahman", "Kohli", "Steve"],
    "Age": [19, 50, 29, 54]
})

In [42]:
obj

    users  Age
0    Mano   19
1  Rahman   50
2   Kohli   29
3   Steve   54

In [43]:
obj.dtypes

users    object
Age       int64
dtype: object

In [45]:
obj2 = obj.to_json

In [61]:
obj.columns = ["users", "age"]

In [62]:
obj

    users  age
0    Mano   19
1  Rahman   50
2   Kohli   29
3   Steve   54

In [67]:
obj.describe()

             age
count   4.000000
mean   38.000000
std    16.753109
min    19.000000
25%    26.500000
50%    39.500000
75%    51.000000
max    54.000000

In [78]:
sortedAccordingToUsers = obj.sort_values(axis=0, by='users')

In [135]:
sortedAccordingToIndex = obj.sort_index(axis=0)

In [145]:
left = pd.DataFrame({
    "key": ["Elon Musk", "Steve Jobs", "Mark Zuckerberg"],
    "Real Age":["48", "54", "37"]
})

In [137]:
left

               key age
0        Elon Musk  48
1       Steve Jobs  54
2  Mark Zuckerberg  37

In [144]:
right = pd.DataFrame({
    "key": ["Elon Musk", "Steve Jobs", "Mark Zuckerberg"],
    "Fake Age": ["29", "33", "75"]
})

In [142]:
right

               key age
0        Elon Musk  29
1       Steve Jobs  33
2  Mark Zuckerberg  75

In [146]:
pd.merge(left, right, on="key")

               key Real Age Fake Age
0        Elon Musk       48       29
1       Steve Jobs       54       33
2  Mark Zuckerberg       37       75

In [161]:
print(np.random.randn(5))

[ 0.77589919 -1.62171581 -0.77607829 -1.24360668 -3.07519977]

In [162]:
right.stack()

0  key               Elon Musk
   Fake Age                 29
1  key              Steve Jobs
   Fake Age                 33
2  key         Mark Zuckerberg
   Fake Age                 75
dtype: object

In [167]:
mid = left.unstack()

In [168]:
mid

key       0          Elon Musk
          1         Steve Jobs
          2    Mark Zuckerberg
Real Age  0                 48
          1                 54
          2                 37
dtype: object

In [169]:
left

               key Real Age
0        Elon Musk       48
1       Steve Jobs       54
2  Mark Zuckerberg       37

In [180]:
mid = mid.cumsum()

In [181]:
mid

key       0                                   Elon Musk
          1                         Elon MuskSteve Jobs
          2          Elon MuskSteve JobsMark Zuckerberg
Real Age  0        Elon MuskSteve JobsMark Zuckerberg48
          1      Elon MuskSteve JobsMark Zuckerberg4854
          2    Elon MuskSteve JobsMark Zuckerberg485437
dtype: object

In [182]:
mid.plot()

ModuleNotFoundError: No module named 'matplotlib'